[
  {
    "title": "For Fellowkids Studio Kiln Shows How Brands Can Behave Like Fans",
    "url": "https://the-brandidentity.com/project/for-fellowkids-studio-kiln-shows-how-brands-can-behave-like-fans",
    "image": "/images/for-fellowkids-studio-kiln-shows-how-brands-can-behave-like-fans-thumb.jpg",
    "tags": [
      "Design",
      "Branding",
      "Inspiration"
    ],
    "source_credit": "Work by For Fellowkids via The Brand Identity",
    "date": "2025-11-10T00:00:00.000Z",
    "slug": "for-fellowkids-studio-kiln-shows-how-brands-can-behave-like-fans",
    "summary": "For Fellowkids, Studio Kiln shows how brands can behave like fans",
    "fullContent": "For Fellowkids, Studio Kiln shows how brands can behave like fans"
  },
  {
    "title": "How Kimera Built Cursors Identity Around A Custom Typeface System",
    "url": "https://the-brandidentity.com/project/how-kimera-built-cursors-identity-around-a-custom-typeface-system",
    "image": "/images/how-kimera-built-cursors-identity-around-a-custom-typeface-system-thumb.jpg",
    "tags": [
      "Design",
      "Branding",
      "Inspiration"
    ],
    "source_credit": "Work by How Kimera via The Brand Identity",
    "date": "2025-11-10T00:00:00.000Z",
    "slug": "how-kimera-built-cursors-identity-around-a-custom-typeface-system",
    "summary": "Kimera led a comprehensive brand refresh for Cursor, an AI code editor targeting professional developers. The project established a bespoke typographic system, Cursor Gothic, that seamlessly integrated brand and product applications. This refined identity balances technical precision with a user-centric design ethos. Unique \"logo ligatures\" and a custom icon set ensure fluid brand expression across Cursor's digital ecosystem, elevating its perception as an indispensable, high-performance tool.",
    "fullContent": "Cursor, a leading type foundry, embarked on a distinctive branding journey that deliberately eschewed wholesale reinvention. The core challenge was to meticulously refine Ben Barry’s original logo, enhancing its versatility and optimizing it for modern digital screens. This required articulating a brand voice that could seamlessly blend high-end technical sophistication, essential for a developer tool, with moments of authentic human warmth. The typographic solution stemmed from an existing affinity: Cursor was captivated by Kimera’s Waldenburg, seeking a bespoke adaptation capable of bridging elegant brand communication with the rigorous demands of a future monospace version for their flagship code editor. It was a brief rooted in evolution, demanding a profound understanding of continuity and future utility.\n\nAt the heart of this comprehensive refresh lies Cursor Gothic, a bespoke typeface meticulously crafted from Kimera’s Waldenburg. While retaining Waldenburg’s intrinsic blend of rationalism and analogue warmth, Kimera subtly condensed letterforms, accentuating squarish characteristics and high contrast for optimal legibility. A pivotal innovation is the \"logo ligatures\" – a sophisticated system embedding Cursor’s logotypes directly into the typeface with optical adjustments, ensuring perfect alignment with text and dissolving the boundary between brand mark and type. This integration extends to a custom icon set, where rounded caps and subtly squarish forms, echoing Waldenburg’s geometry, achieve seamless functionality across UI and code editor. The core cube logo, derived from Barry's original, was expanded into versatile flat, 2.5D, and 3D versions, each refined with optical adjustments prioritizing visual truth over geometric precision for screen-based impact.\n\nThe brand’s distinctive colour palette further reinforces this dual nature, deliberately diverging from typical tech cool tones for a subtly warm undertone. An accent orange, inspired by industrial power tools, grounds Cursor’s technical prowess while echoing its human-centric warmth. The digital experience redefines industry standards; Cursor’s website transcends static showcases by integrating dynamic, interactive product elements. Users engage with real UI components, exploring key features directly in-browser via CSS-built mini code editors, demonstrating product capabilities experientially. This holistic approach, as articulated by Justin Jay Wang, represented a strategic 'foundation reset'—refining core ingredients to be 'fewer but better.' The forthcoming Cursor Mono, a monospace extension, will ultimately complete this vision, seamlessly integrating the brand's bespoke typography into the code editor itself. This project stands as a testament to the power of a unified typographic language, where brand and product design coexist in harmony, fostering consistency across every touchpoint."
  },
  {
    "title": "How Wedge Shifted Allergen Brand Growhappy From Fear To Confidence",
    "url": "https://the-brandidentity.com/project/how-wedge-shifted-allergen-brand-growhappy-from-fear-to-confidence",
    "image": "/images/how-wedge-shifted-allergen-brand-growhappy-from-fear-to-confidence-thumb.jpg",
    "tags": [
      "Design",
      "Branding",
      "Inspiration"
    ],
    "source_credit": "Work by How Wedge via The Brand Identity",
    "date": "2025-11-10T00:00:00.000Z",
    "slug": "how-wedge-shifted-allergen-brand-growhappy-from-fear-to-confidence",
    "summary": "Our project with GrowHappy reimagined early allergen introduction, shifting the narrative from apprehension to empowerment. We strategically pioneered 'ImmunoNutrition,' reframing exposure as proactive immune development. Rejecting clinical aesthetics, the visual identity embraces warmth and reassurance, drawing from storybook charm for an approachable yet credible presence. This cohesive system empowers parents with scientific clarity, fostering confidence and joyful food freedom for their children.",
    "fullContent": "Stephanie Wibom's personal journey, spurred by her daughter’s allergic reaction, revealed a critical void: the disconnect between robust scientific evidence for early allergen introduction and actionable, reassuring solutions for parents. This insight birthed GrowHappy, a brand poised to bridge this gap, yet facing a formidable challenge. The existing landscape of allergen management was dominated by fear-mongering rhetoric and clinical, pharmaceutical aesthetics, leaving parents overwhelmed and anxious. Simply presenting scientific facts would not suffice; GrowHappy needed to transcend fear, offering not just a product, but a profound shift in mindset. Independent creative studio Wedge was tasked with this monumental challenge: to strategically reposition early allergen introduction and forge a visual language that would empower, rather than intimidate, parents navigating this crucial developmental stage.\n\nWedge’s strategic breakthrough lay in a powerful redefinition of the category itself. Moving beyond the language of fear, they coined \"ImmunoNutrition,\" an innovative term that reframes early allergen exposure as a proactive, nourishing act contributing to immune system development. This semantic pivot instantly differentiates GrowHappy, positioning it as the pioneering leader in a newly articulated space. Complementing this, the product line, \"ImmunoButters,\" succinctly communicates both format and benefit, making the concept immediately accessible. This linguistic ingenuity, developed in tandem with a calm and trustworthy design approach, enables GrowHappy to champion science not through clinical detachment, but through an empowering narrative of food freedom and robust health, replacing apprehension with confidence.\n\nThe visual identity of GrowHappy deliberately deviates from the clinical austerity typically found in the category. Instead, Wedge drew inspiration from the comforting, engaging worlds of storybooks and classic baby products, prioritising reassurance over medical association. The brand's colour palette embraces soft, muted tones, a conscious departure from stark medical whites or bold primaries, fostering a sense of calm. A meticulously developed type system balances clarity and authority with inherent warmth, ensuring accessibility without compromising expertise. Crucially, the packaging features elegant illustrations inspired by vintage botanical fruit and vegetable plates. This artful choice signals authenticity—emphasising whole, natural foods over supplements—while imbuing the brand with a sense of heritage, trustworthiness, and gentle educational appeal, crafting a world that feels approachable and optimistic.\n\nThe culmination of this strategic and creative synergy is a brand that serves as both an empathetic companion and an authoritative guide. GrowHappy's design ethos meticulously avoids anything clinical or fear-driven, instead presenting parents with soft, organised, and reassuring touchpoints that instantly communicate clarity and build confidence. The packaging transcends mere product information, subtly conveying that allergens are not threats to be managed, but integral components of a holistic diet essential for immune health and gut development. Launched to redefine its category, GrowHappy empowers parents to engage with early allergen introduction as an act of courageous nourishment, fostering peace of mind and shifting the conversation from risk mitigation to proactive wellness."
  },
  {
    "title": "Los Yorks Pixel Based System Gives Netflixs Eyeline A Bold New Vision",
    "url": "https://the-brandidentity.com/project/los-yorks-pixel-based-system-gives-netflixs-eyeline-a-bold-new-vision",
    "image": "/images/los-yorks-pixel-based-system-gives-netflixs-eyeline-a-bold-new-vision-thumb.jpg",
    "tags": [
      "Design",
      "Branding",
      "Inspiration"
    ],
    "source_credit": "Work by Los Yorks via The Brand Identity",
    "date": "2025-11-10T00:00:00.000Z",
    "slug": "los-yorks-pixel-based-system-gives-netflixs-eyeline-a-bold-new-vision",
    "summary": "Los York developed a dynamic brand identity for Eyeline, Netflix's evolving VFX studio. The core concept, \"the pixel as origin,\" elegantly conveys their synthesis of technical precision and creative artistry. A modular, grid-based system seamlessly unifies three divisions—VFX, Studios, and Labs—using a distinct RGB color palette. This forward-thinking framework, pairing cinematic typography with digital precision, crafts a sophisticated visual language that elevates Eyeline beyond industry clichés, positioning them for future innovation.",
    "fullContent": "Eyeline, a powerhouse at the nexus of visual effects, virtual production, and experimental technology, presented a unique branding challenge. Comprising three distinct divisions—VFX, Studios, and Labs—the company required an identity that could unify its multifaceted operations while allowing each specialized arm to articulate its individual voice. The objective was to transcend the often-clichéd visual language of the VFX industry, instead crafting a sophisticated, timeless brand that spoke to both its rich legacy and its future-forward innovative spirit, capable of scaling from boutique artistry to global productions for clients like Netflix.\n\nLos York’s strategic solution unearthed a deceptively simple yet profoundly resonant core idea: the pixel as origin. This fundamental building block, the smallest unit of vision, became the perfect metaphor for Eyeline’s intricate blend of technology and creativity. It represented the singular spark from which entire worlds are constructed, laying the groundwork for a modular and infinitely expressive design language. This shared graphic DNA emphasized structure, precision, and boundless possibility, while a shrewd application of color differentiated the divisions: red for Studios, green for VFX, and blue for Labs, collectively forming the elemental RGB spectrum inherent to image-making itself.\n\nFrom this conceptual bedrock, a sophisticated design system unfolded. The pixel evolved into a dynamic, grid-based framework that scales seamlessly from intricate detail to sweeping macro expressions. This modularity not only mirrors Eyeline’s collaborative creative process but also offers a flexible canvas, allowing layouts to adapt and reconfigure across diverse contexts—from film sets to R&D environments—all while maintaining an underlying order. Typographically, the identity masterfully balances contrasts, pairing the cinematic warmth of ITC Garamond Light Narrow with the technical precision and digital forwardness of Netflix Sans. This deliberate tension between serif and sans mirrors the brand's core duality: where imagination meets engineering, grounding the cutting-edge in human artistry.\n\nThe impact of this meticulously crafted identity has been resoundingly positive. By intentionally eschewing typical VFX tropes, Los York succeeded in creating a clean, confident frame that elevates Eyeline's exceptional craft, allowing their work to truly speak for itself. The brand now eloquently communicates a shift from a company defined by technology to a creative force driven by imagination. Leaders at Eyeline laud the new identity for perfectly capturing their spirit and future direction, noting widespread peer acclaim. This framework, designed for clarity and control yet built for movement and adaptability, ensures Eyeline can continue to innovate globally while maintaining a cohesive, authentic brand presence."
  }
]