[
  {
    "title": "For Fellowkids Studio Kiln Shows How Brands Can Behave Like Fans",
    "url": "https://the-brandidentity.com/project/for-fellowkids-studio-kiln-shows-how-brands-can-behave-like-fans",
    "image": "/images/for-fellowkids-studio-kiln-shows-how-brands-can-behave-like-fans-thumb.jpg",
    "tags": [
      "Design",
      "Branding",
      "Inspiration"
    ],
    "source_credit": "Work by For Fellowkids via The Brand Identity",
    "date": "2025-11-09T00:00:00.000Z",
    "slug": "for-fellowkids-studio-kiln-shows-how-brands-can-behave-like-fans",
    "summary": "Studio Kiln crafted a dynamic brand identity for Fellowkids, an agency at the intersection of esports and entertainment. Addressing their expanded scope, the design strategically embodies authentic fandom. A versatile 'Fellowkid' character, conceptualized as a collectible art toy, anchors the visual narrative, enabling responsive community engagement. This is complemented by a vibrant, Y2K-inspired aesthetic and contemporary typography, resulting in a sophisticated, adaptive system that resonates authentically with its audience and truly behaves like a fan.",
    "fullContent": "In the dynamic landscape of modern entertainment, where digital communities thrive and allegiances are passionately forged, Fellowkids stands as an agency dedicated to building authentic fandoms. As their influence grew, however, their own brand identity began to feel outpaced, struggling to encapsulate their unique blend of serious playfulness and anti-corporate edge. The challenge for Studio Kiln was to craft an identity that not only matched Fellowkids' escalating calibre of work but authentically embodied the very spirit of fandom itself – responsive, adaptable, and deeply engaged with community culture, without succumbing to inauthentic \"corporate cosplay.\"\n\nStudio Kiln’s creative solution centered on a deceptively simple yet profound insight: if Fellowkids builds fandom for others, its brand should *behave* like a fan. This philosophy culminated in the creation of \"The Fellowkid\"—a hooded, gender-neutral figure designed to be the identity's emotional core. Recognizable across esports, entertainment, and sports, the hoodie serves as a universal symbol of belonging. This distinctive silhouette empowers the Fellowkid to effortlessly shift allegiances, adopting various colors, textures, and graphics to represent diverse teams and moments. Crucially, the concept was first materialized as a physical vinyl art toy, making the brand itself a collectible piece of culture, transforming the abstract promise of fandom into a tangible, interactive reality.\n\nTo support this core character, Studio Kiln constructed a vibrant, Y2K-inspired visual world. This aesthetic draws from nostalgic tech cues, featuring translucent plastics, candy-bright hues, saturated neons, and deep blacks. A deliberate palette shift allows the brand to amplify \"hype\" moments with hot accents while maintaining sophistication and groundedness with softer hardware greys. Typographically, Aeonik provides a critical counterweight, offering clarity and neutrality against the system's bespoke, Y2K-flavoured elements, with Aeonik Mono lending a subtle technical inflection. The entire system is designed as a modular \"digital sticker sheet\"—an eclectic kit of character icons, custom typography, and decals, anchored by a simple grid, empowering the Fellowkids team to create dynamic, engaging assets with ease.\n\nThe impact of this comprehensive rebrand has been immediate and resonant. Fellowkids has noted tangible wins, with new clients specifically commending the redesigned pitch decks for their energetic, clean, and exciting presentation. The vinyl art toy, in particular, has become a potent symbol, celebrated for its playful yet premium, collectible yet accessible nature—a direct reflection of Fellowkids' ethos of taking fandom seriously without taking themselves too seriously. This refreshed identity has not only elevated Fellowkids' external perception to match their ambition but has also unlocked deeper internal confidence, truly living their values, and fostering a brand experience that beckons users to collect, customize, and ultimately, root for Fellowkids."
  },
  {
    "title": "How Kimera Built Cursors Identity Around A Custom Typeface System",
    "url": "https://the-brandidentity.com/project/how-kimera-built-cursors-identity-around-a-custom-typeface-system",
    "image": "/images/how-kimera-built-cursors-identity-around-a-custom-typeface-system-thumb.jpg",
    "tags": [
      "Design",
      "Branding",
      "Inspiration"
    ],
    "source_credit": "Work by How Kimera via The Brand Identity",
    "date": "2025-11-09T00:00:00.000Z",
    "slug": "how-kimera-built-cursors-identity-around-a-custom-typeface-system",
    "summary": "We partnered with Kimera to redefine Cursor's identity, an AI code editor for professional developers. The project centered on a bespoke typeface system, Cursor Gothic, meticulously crafted to integrate brand communications with the product's UI. This sophisticated solution included unique logo ligatures and a custom icon set, ensuring a cohesive, high-performance visual language. It elegantly balances technical precision with refined humanistic touches across all touchpoints.",
    "fullContent": "In a landscape often dominated by radical reinvention, Cursor presented an unusual yet insightful directive for their branding refresh: don't reinvent, but rather refine and elevate. The core challenge for Kimera, the design studio tasked with the project, was to distill Cursor’s established essence – a blend of high-end technical sophistication and warm, human accessibility – into a versatile, screen-optimised visual language. This ambition extended beyond typical brand guidelines, aiming for a custom typeface that would not only define their external identity but seamlessly transition into a monospace version for their flagship code editor, unifying brand and product at the deepest level.\n\nAt the heart of this comprehensive refresh lies Cursor Gothic, a bespoke typeface meticulously crafted from Kimera’s retail offering, Waldenburg. Cursor's existing affinity for Waldenburg meant the project wasn't about altering its elegant letterforms, but enhancing its functional prowess. Kimera thoughtfully condensed the typeface, intensifying its characteristic squarish shapes and contrast for improved readability and rhythm across various text sizes. A truly innovative feature emerged in the form of \"logo ligatures,\" where Cursor's lockups and logos were embedded directly within the font, pre-optimised with optical adjustments to ensure perfect alignment with surrounding text – collapsing the traditional divide between branding and typography. This meticulous integration extended to a custom icon set, carefully designed with rounded caps and subtly squared corners to achieve harmony across both website UI and the demanding environment of a code editor.\n\nThe visual system further unfolded with a sophisticated evolution of Cursor’s original cube logo into three distinct versions: a primary flat icon, a multi-planar 2.5D iteration, and a fully rendered 3D version for app integration. Each was precisely adjusted for optical clarity across diverse contexts, subtly rounding sharp edges and offsetting elements to counteract the pitfalls of geometric purity on screen. The brand's color palette deliberately diverges from typical tech sterility, introducing warm undertones and an unexpected, vibrant orange accent – a subtle nod to industrial power tools – to reinforce its unique positioning. This sophisticated visual identity culminates in Cursor’s website, which eschews static mockups for immersive, interactive product elements that allow users to engage directly with mini code editors, bringing the product experience to the forefront of brand communication.\n\nThis carefully curated identity is not a departure, but a profound articulation of Cursor’s existing strengths. As the forthcoming Cursor Mono, a monospace extension, integrates directly into the product, the project will achieve its ultimate goal: a unified typographic ecosystem that bridges every touchpoint from marketing to the daily developer experience. By treating the refresh as a foundational reset rather than a definitive endpoint, Cursor has established a consistent, sophisticated, and deeply integrated brand that speaks the same refined language across every dimension, setting a new benchmark for brand-product synergy in the tech space."
  },
  {
    "title": "How Wedge Shifted Allergen Brand Growhappy From Fear To Confidence",
    "url": "https://the-brandidentity.com/project/how-wedge-shifted-allergen-brand-growhappy-from-fear-to-confidence",
    "image": "/images/how-wedge-shifted-allergen-brand-growhappy-from-fear-to-confidence-thumb.jpg",
    "tags": [
      "Design",
      "Branding",
      "Inspiration"
    ],
    "source_credit": "Work by How Wedge via The Brand Identity",
    "date": "2025-11-09T00:00:00.000Z",
    "slug": "how-wedge-shifted-allergen-brand-growhappy-from-fear-to-confidence",
    "summary": "Our collaboration with GrowHappy reimagined early allergen introduction, transforming parental apprehension into assurance. Addressing the disconnect between science and sentiment, we strategically positioned the brand by coining \"ImmunoNutrition,\" reframing early exposure as vital immune system development. The sophisticated visual identity, eschewing clinical aesthetics for storybook charm, utilizes a warm, muted palette and inviting typography. This design-led approach fosters confidence, empowers parents, and establishes GrowHappy as an empathetic leader in a critical health category.",
    "fullContent": "The genesis of GrowHappy sprung from a deeply personal experience, as founder Stephanie Wibom navigated her own daughter's allergic reaction, revealing a critical disconnect between scientific understanding and practical application in early allergen introduction. Despite robust clinical evidence supporting early exposure, the existing market was mired in fear-mongering narratives and a starkly pharmaceutical aesthetic, intensifying parental anxiety rather than alleviating it. This environment presented a formidable brand challenge: how to empower parents with confidence in prevention, shifting their mindset from trepidation to proactive nourishment within a category that historically profited from panic.\n\nTasked with this transformative brief, independent creative studio Wedge understood that a mere scientific explanation wouldn't suffice. Their strategic breakthrough culminated in the coinage of \"ImmunoNutrition\" – a powerful semantic reframing that repositioned early allergen exposure not as a risk to be managed, but as a vital act of building and nourishing a child's immune system. This innovative category definition, paired with the straightforward product line, ImmunoButters, immediately established GrowHappy as a pioneering leader, carving out distinct distance from fear-based competitors and empowering parents with a new, positive vocabulary for food freedom.\n\nThe visual language for GrowHappy deliberately veers away from clinical austerity, drawing unexpected inspiration from the reassuring warmth of storybooks and classic baby products. Instead of medical whites or bold primary colours, a palette of soft, muted tones envelops the brand, communicating calm and trustworthiness. Typography was meticulously developed to convey authority and clarity while maintaining an approachable warmth. Crucially, the packaging features exquisite illustrations inspired by vintage botanical fruit-and-vegetable plates. This artistic choice not only signals that these are real, whole foods rather than supplements, but also imbues the brand with a sense of heritage, educational value, and gentle optimism, making the daunting task of allergen introduction feel inviting and natural.\n\nThe result is a brand experience that functions as both expert guide and empathetic companion. Every touchpoint, from the organised information architecture to the thoughtfully composed illustrations, works synergistically to make parents feel capable and informed rather than cautious and overwhelmed. GrowHappy reimagines allergens not as threats, but as essential components of a wholesome diet critical for immune health and gut development. Launched to redefine its category, GrowHappy has successfully championed a new conversation: one where early allergen introduction is embraced as an act of nourishing courage, empowering families to approach their child's nutrition with clarity, confidence, and genuine joy."
  },
  {
    "title": "Los Yorks Pixel Based System Gives Netflixs Eyeline A Bold New Vision",
    "url": "https://the-brandidentity.com/project/los-yorks-pixel-based-system-gives-netflixs-eyeline-a-bold-new-vision",
    "image": "/images/los-yorks-pixel-based-system-gives-netflixs-eyeline-a-bold-new-vision-thumb.jpg",
    "tags": [
      "Design",
      "Branding",
      "Inspiration"
    ],
    "source_credit": "Work by Los Yorks via The Brand Identity",
    "date": "2025-11-09T00:00:00.000Z",
    "slug": "los-yorks-pixel-based-system-gives-netflixs-eyeline-a-bold-new-vision",
    "summary": "Los York crafted a dynamic brand identity for Eyeline, the VFX powerhouse, to reflect its strategic evolution. Eschewing industry clichés, the design system centers on a foundational pixel concept, building a scalable, modular visual language. This unified aesthetic, articulated across Eyeline's three divisions via an RGB chromatic spectrum, resonates with top filmmakers and emerging talent. The harmonious typographic interplay of Garamond and Netflix Sans evokes cinematic heritage alongside digital innovation, reflecting Eyeline's blend of artistry and engineering.",
    "fullContent": "Eyeline, a powerhouse at the nexus of visual effects, virtual production, and experimental technology, faced a nuanced branding challenge. With three distinct divisions—VFX, Studios, and Labs—the organization sought a cohesive identity to articulate their singular vision while celebrating each specialized arm. The objective was to transcend the often-clichéd visual language of the VFX industry, moving beyond mere technical display to instead communicate the profound creative thinking and intricate craftsmanship inherent in their work. The brand also needed to project artisanal quality capable of global scalability, establishing a unified presence that spoke to both rich legacy and ambitious future.\n\nLos York's strategic response centered on a deceptively simple yet profoundly resonant concept: the pixel as origin. This elemental building block, the smallest unit of vision, became the powerful metaphor for Eyeline’s intricate process—a single spark unlocking infinite visual potential where technology and creativity are inseparable. This core idea enabled a departure from conventional industry tropes, reframing Eyeline's 'thinking' and craft rather than merely showcasing its technical output. The pixel was reimagined not as an effect, but as a window and canvas, creating a clean, confident frame around the artistry itself, thereby establishing a modular and highly expressive design language.\n\nThe pixel concept organically evolved into a sophisticated, grid-based system, designed for infinite scalability—from minute detail to expansive expression—mirroring Eyeline's dynamic, collaborative workflows and providing adaptability for diverse layouts while maintaining underlying order. A deliberate color strategy differentiated the divisions: Studios in vibrant red, VFX in vivid green, and Labs in deep blue, together forming a complete RGB spectrum, acknowledging the elemental forces of image-making. Typographically, the identity balances heritage with innovation, pairing the cinematic warmth of ITC Garamond Light Narrow with the modern, technical precision of Netflix Sans. This deliberate tension between serif and sans expertly articulates the brand’s core duality: where imaginative artistry converges with engineering prowess.\n\nThe successful rollout of this redefined identity has been met with enthusiastic acclaim, both internally and across the industry. Eyeline’s leadership praised the new brand's ability to capture the organization's spirit and future trajectory, while peers lauded its distinctiveness, collaborative ethos, and fresh departure from industry norms. For Los York, the project’s resonance lies in its enduring ability to bridge legacy with future—crafting an identity that speaks to today’s filmmaking pioneers and the artists redefining tomorrow. This rebrand marks Eyeline's pivotal transformation from a name rooted in technological prowess to a vibrant creative force driven by imagination, where every design decision reinforces the limitless possibilities born from technology meeting vision."
  }
]