[
  {
    "title": "For Fellowkids Studio Kiln Shows How Brands Can Behave Like Fans",
    "url": "https://the-brandidentity.com/project/for-fellowkids-studio-kiln-shows-how-brands-can-behave-like-fans",
    "image": "/images/for-fellowkids-studio-kiln-shows-how-brands-can-behave-like-fans-thumb.jpg",
    "tags": [
      "Design",
      "Branding",
      "Inspiration"
    ],
    "source_credit": "Work by For Fellowkids via The Brand Identity",
    "date": "2025-11-10T00:00:00.000Z",
    "slug": "for-fellowkids-studio-kiln-shows-how-brands-can-behave-like-fans",
    "summary": "For Fellowkids, Studio Kiln shows how brands can behave like fans",
    "fullContent": "For Fellowkids, Studio Kiln shows how brands can behave like fans"
  },
  {
    "title": "How Kimera Built Cursors Identity Around A Custom Typeface System",
    "url": "https://the-brandidentity.com/project/how-kimera-built-cursors-identity-around-a-custom-typeface-system",
    "image": "/images/how-kimera-built-cursors-identity-around-a-custom-typeface-system-thumb.jpg",
    "tags": [
      "Design",
      "Branding",
      "Inspiration"
    ],
    "source_credit": "Work by How Kimera via The Brand Identity",
    "date": "2025-11-10T00:00:00.000Z",
    "slug": "how-kimera-built-cursors-identity-around-a-custom-typeface-system",
    "summary": "",
    "fullContent": ""
  },
  {
    "title": "How Wedge Shifted Allergen Brand Growhappy From Fear To Confidence",
    "url": "https://the-brandidentity.com/project/how-wedge-shifted-allergen-brand-growhappy-from-fear-to-confidence",
    "image": "/images/how-wedge-shifted-allergen-brand-growhappy-from-fear-to-confidence-thumb.jpg",
    "tags": [
      "Design",
      "Branding",
      "Inspiration"
    ],
    "source_credit": "Work by How Wedge via The Brand Identity",
    "date": "2025-11-10T00:00:00.000Z",
    "slug": "how-wedge-shifted-allergen-brand-growhappy-from-fear-to-confidence",
    "summary": "",
    "fullContent": ""
  },
  {
    "title": "Los Yorks Pixel Based System Gives Netflixs Eyeline A Bold New Vision",
    "url": "https://the-brandidentity.com/project/los-yorks-pixel-based-system-gives-netflixs-eyeline-a-bold-new-vision",
    "image": "/images/los-yorks-pixel-based-system-gives-netflixs-eyeline-a-bold-new-vision-thumb.jpg",
    "tags": [
      "Design",
      "Branding",
      "Inspiration"
    ],
    "source_credit": "Work by Los Yorks via The Brand Identity",
    "date": "2025-11-10T00:00:00.000Z",
    "slug": "los-yorks-pixel-based-system-gives-netflixs-eyeline-a-bold-new-vision",
    "summary": "Los York crafted a striking identity for Eyeline, Netflix's VFX powerhouse, anchored by the foundational pixel. This modular, grid-based system elegantly unifies the studio's three divisions, employing a full RGB spectrum for distinction. The typographic interplay of ITC Garamond and Netflix Sans speaks to both cinematic artistry and digital precision. Eschewing industry clichés, the resulting framework offers infinite scalability, positioning Eyeline as a visionary leader in visual effects, appealing to top filmmakers and emerging talent alike.",
    "fullContent": "The resulting identity is built around a deceptively simple idea: the pixel as origin. One spark, one drop, one building block that unlocks infinite visual potential. From this foundation, a modular, expressive design language unfolds. “The pixel quickly became the natural starting point – the smallest possible unit of vision, and a perfect metaphor for Eyeline’s work, where technology and creativity are inseparable,” explains Creative Director Michael Mavian. “Everything they make begins with a single point of light that expands into entire worlds.”\n\nEyeline brings together three distinct divisions: VFX, Studios and Labs. Each represents a different dimension of the creative process, from world-class artistry and on-set virtual production to experimental technology. Los York’s solution began with a shared graphic DNA rooted in structure, precision and possibility, with each division taking on its own voice through colour. Studios uses red, VFX uses green and Labs uses blue – together ..."
  }
]