[
  {
    "title": "For Fellowkids Studio Kiln Shows How Brands Can Behave Like Fans",
    "url": "https://the-brandidentity.com/project/for-fellowkids-studio-kiln-shows-how-brands-can-behave-like-fans",
    "image": "/images/for-fellowkids-studio-kiln-shows-how-brands-can-behave-like-fans-thumb.jpg",
    "tags": [
      "Design",
      "Branding",
      "Inspiration"
    ],
    "source_credit": "Work by For Fellowkids via The Brand Identity",
    "date": "2025-11-09T00:00:00.000Z",
    "slug": "for-fellowkids-studio-kiln-shows-how-brands-can-behave-like-fans",
    "summary": "Studio Kiln developed a transformative brand identity for Fellowkids, an expanding esports and entertainment agency. Moving beyond conventional branding, the project embodies an \"active fandom\" ethos. Central to this is the adaptable Fellowkid character, initially conceived as a collectible art toy, symbolizing authentic community engagement and dynamic allegiance. A Y2K-inspired visual system, employing vibrant neons, translucent textures, and custom typography, allows the brand to effortlessly shift from high-energy expression to sophisticated strategic communication.",
    "fullContent": "Crafting Fandom: Studio Kiln's Vision for Fellowkids\n\nFellowkids, an agency expert in cultivating fandom for others, faced a paradox: their existing brand no longer reflected their expertise or distinctive 'rock and roll' ethos. Having outgrown their visual representation, they sought an identity that was seriously playful, confidently edgy, and non-corporate – a visual language befitting their high-calibre work. Studio Kiln’s response was rooted in a profound insight: if Fellowkids orchestrates fandom, their brand must embody the spirit of a fan itself. This required an identity that didn't just speak *to* fans, but genuinely *behaved* like one – responsive, dynamic, and intrinsically connected to the community, eschewing corporate artifice.\n\nThis fundamental understanding culminated in the creation of the Fellowkid character, a hooded figure, the brand's emotional anchor. The hoodie, a universal identifier across esports, entertainment, and sports cultures, was not an arbitrary choice. The Fellowkid isn’t static; its distinctive silhouette is a chameleonic canvas, swapping colours, textures, and graphics to embody diverse allegiances – a singular figure with infinite identities. Crucially, the concept first materialized as a physical vinyl art toy. This wasn't an extension, but the *core idea*: transforming the brand itself into a tangible, collectible artifact. This commitment to tangible fandom made the promise of engagement unequivocally real.\n\nAround this iconic character, Studio Kiln crafted a Y2K-inspired visual ecosystem. Drawing from nostalgic tech cues, the visual world features translucent plastics, candy-bright hues, saturated neons, and deep blacks. A dynamic palette uses 'hot accents' for high-energy moments, balanced by sophisticated 'hardware greys' that ground the system and ensure versatility. Aeonik anchors the typography with its clear, neutral, and open characteristics. Its mono cut adds a subtle technical inflection for UI, balancing the bespoke, Y2K-flavored lettering. This ensures credibility and legibility, freeing custom graphics for emotional expression. The modular system functions as a 'digital sticker sheet' – an eclectic kit of character icons, custom type, and decals on a simple grid – empowering the Fellowkids team to swiftly generate lively, engaging assets, embracing a \"plug and play\" approach.\n\nThe rebrand's impact was immediate and profound. Tangible successes include client commendations for the brand's energetic, clean, and exciting pitch presentations. The vinyl toy, in particular, garnered immense enthusiasm, celebrated for its playful yet premium, collectible yet accessible appeal – a perfect reflection of an agency that takes fandom seriously but never itself. Fundamentally, the new identity unlocked Fellowkids’ true potential, aligning their sophisticated visual presence with their high-calibre work. It enables a confident, edgy, and authentic presence across all platforms – from pitches to presentations – transforming their brand from something observed into something deeply rooted for, rekindling a sense of belonging and nostalgic desire for collection and customization."
  },
  {
    "title": "How Kimera Built Cursors Identity Around A Custom Typeface System",
    "url": "https://the-brandidentity.com/project/how-kimera-built-cursors-identity-around-a-custom-typeface-system",
    "image": "/images/how-kimera-built-cursors-identity-around-a-custom-typeface-system-thumb.jpg",
    "tags": [
      "Design",
      "Branding",
      "Inspiration"
    ],
    "source_credit": "Work by How Kimera via The Brand Identity",
    "date": "2025-11-09T00:00:00.000Z",
    "slug": "how-kimera-built-cursors-identity-around-a-custom-typeface-system",
    "summary": "For AI code editor Cursor, we meticulously crafted a sophisticated brand identity, anchored by a bespoke typeface, Cursor Gothic. In partnership with Kimera, the project encompassed refining the existing logo and developing a comprehensive typographic system for both brand and product interfaces. This integrated solution features unique logo ligatures and optimized icons, delivering seamless functionality and a high-performance aesthetic. It culminates in a custom monospace, meticulously bridging brand communication with practical coding utility.",
    "fullContent": "Cursor, a company renowned in its niche, faced a unique branding challenge: evolution, not revolution. The directive was to refine and elevate an established identity, enhancing versatility and screen performance while balancing high-end technical sophistication with approachable human warmth. Crucially, this revitalization needed to extend beyond marketing visuals, seamlessly integrating into their core product—a high-performance code editor. This demanded a holistic approach where brand identity and product utility would speak a unified language, preserving existing equity while propelling the brand forward with refined clarity and purpose.\n\nTo meet this intricate brief, Cursor partnered with type foundry Kimera, drawn to their retail typeface Waldenburg. This served as the foundational inspiration for Cursor Gothic, a bespoke typeface meticulously crafted to embody Cursor's brand values. Kimera refined Waldenburg's blend of rational Akzidenz-Grotesk sensibility and inviting Univers warmth. The custom iteration was subtly condensed, with squarish forms and higher contrast precisely tuned for rhythm and legibility across various sizes. More than a branding asset, Cursor Gothic was envisioned as a living typographic system, designed from inception to eventually translate into a monospace version for the code editor, demonstrating profound integration of brand and product design.\n\nThe project's ingenuity is evident in its detailed execution of key design elements. A standout innovation is the \"logo ligatures\" within Cursor Gothic, allowing logotypes to be embedded directly in the typeface for perfect optical alignment with text, collapsing the boundary between branding and typography. The extensive icon set, crucial for both UI and code editor, was crafted with rounded caps and squarish forms for optimal screen legibility, mirroring the typeface’s character. Ben Barry's original cube logo was extended into 2D, 2.5D, and 3D iterations, with optical adjustments—like subtly rounded corners—prioritized over mathematical purity for clarity on screen. The colour palette consciously diverges from typical tech norms, embracing warm undertones and an orange accent inspired by power tools, reinforcing Cursor’s human-centric positioning. Furthermore, the website offers interactive product elements, letting users experience code editor functionality directly in-browser, underscoring this deep integration.\n\nUltimately, this strategic brand refresh functions not as a definitive endpoint but as a robust foundation for continuous evolution. As Justin Jay Wang insightfully notes, the initiative aimed to \"refine what already worked,\" strategically leveraging existing brand equity and distilling core ingredients for enhanced impact. The forthcoming Cursor Mono, a monospace extension, will complete the vision, serving as the primary typeface within the code editor and solidifying the bridge between brand communication and product functionality. This project powerfully demonstrates how a unified typographic language, meticulously designed to meet the specific demands of both brand identity and an immersive product experience, fosters unparalleled consistency and a deeply integrated user journey across every touchpoint."
  },
  {
    "title": "How Wedge Shifted Allergen Brand Growhappy From Fear To Confidence",
    "url": "https://the-brandidentity.com/project/how-wedge-shifted-allergen-brand-growhappy-from-fear-to-confidence",
    "image": "/images/how-wedge-shifted-allergen-brand-growhappy-from-fear-to-confidence-thumb.jpg",
    "tags": [
      "Design",
      "Branding",
      "Inspiration"
    ],
    "source_credit": "Work by How Wedge via The Brand Identity",
    "date": "2025-11-09T00:00:00.000Z",
    "slug": "how-wedge-shifted-allergen-brand-growhappy-from-fear-to-confidence",
    "summary": "Our strategic initiative for GrowHappy redefined early allergen introduction. We shifted the narrative from parental apprehension to empowered prevention by pioneering the 'ImmunoNutrition' category. This reframing positions early exposure as a vital step in immune development. Visually, we moved away from clinical aesthetics, crafting a reassuring brand world with a soft palette and approachable typography. This thoughtful design fosters confidence and clarity, establishing GrowHappy as the trusted leader in a sensitive, crucial space.",
    "fullContent": "GrowHappy emerged from a profoundly personal space, founded by Stephanie Wibom after experiencing her daughter's allergic reaction. Collaborating with leading pediatric allergen experts, GrowHappy sought to translate vital prevention guidelines into accessible solutions for parents. However, the existing landscape presented a significant emotional barrier: a category saturated with fear-based messaging and clinical, pharmaceutical aesthetics. The challenge wasn't just about presenting scientific evidence; it was about fundamentally shifting parental mindset from anxiety and apprehension to confidence and empowerment in early allergen introduction. This demanded a redefinition of the conversation itself, moving beyond a reactive, medical framework towards a proactive, nurturing approach.\n\nTo navigate this intricate emotional and scientific terrain, GrowHappy engaged Wedge, the independent creative studio known for its strategic depth. Their mandate was clear: not just to design a product, but to engineer a new brand paradigm that would genuinely empower parents. The strategic breakthrough manifested in a powerful linguistic innovation. Wedge coined an entirely new category: \"ImmunoNutrition.\" This term masterfully reframes early allergen exposure, positioning it as nourishing and building a child’s immune system, not a risk to be managed. Paired with the product line, \"ImmunoButters,\" the terminology immediately clarifies both benefit and format, establishing GrowHappy as a pioneering leader, distinguishing it from a crowded, fear-driven market.\n\nThe visual language for GrowHappy deliberately veers from the clinical sterility typical of the allergen introduction space. It draws inspiration from the reassuring warmth of storybooks and classic baby product aesthetics, a psychological choice for comfort over intimidation. The palette embraces soft, muted tones, a calming contrast to the stark whites or primary colours often associated with medicinal products. Typography balances clarity and authority with an inviting warmth, ensuring expertise feels accessible. A standout element is the illustration system, inspired by vintage botanical fruit-and-vegetable plates. This choice serves multiple purposes: reinforcing the brand’s whole-food focus, imparting heritage and trustworthiness, and adding a gentle, educational quality to guide parents through a potentially anxious experience with optimistic, organised calm.\n\nThis thoughtful design strategy culminates in a brand functioning as both empathetic companion and expert guide. GrowHappy’s touchpoints are intentionally devoid of clinical or fear-driven elements, presenting a soft, organised, and profoundly reassuring experience. Parents instinctively grasp the product's purpose and significance, fostering confidence through clarity rather than coercion. The packaging itself communicates a paradigm shift: allergens are recast not as threats, but as integral components of a wholesome diet essential for immune health and gut development. Launched strategically to coincide with Mother’s Day and Allergy Awareness Week, GrowHappy proudly pioneers the ImmunoNutrition category, fundamentally reshaping the dialogue around early allergen introduction from apprehension to empowerment and nourishing possibility."
  },
  {
    "title": "Los Yorks Pixel Based System Gives Netflixs Eyeline A Bold New Vision",
    "url": "https://the-brandidentity.com/project/los-yorks-pixel-based-system-gives-netflixs-eyeline-a-bold-new-vision",
    "image": "/images/los-yorks-pixel-based-system-gives-netflixs-eyeline-a-bold-new-vision-thumb.jpg",
    "tags": [
      "Design",
      "Branding",
      "Inspiration"
    ],
    "source_credit": "Work by Los Yorks via The Brand Identity",
    "date": "2025-11-09T00:00:00.000Z",
    "slug": "los-yorks-pixel-based-system-gives-netflixs-eyeline-a-bold-new-vision",
    "summary": "We developed a sophisticated brand identity for Eyeline, Netflix’s elite VFX partner. Shifting from its legacy, our solution anchors on the pixel as the elemental spark for infinite visual potential. A modular, grid-based language unifies its VFX, Studios, and Labs divisions via an RGB spectrum, symbolizing core image-making. Typography blends cinematic Garamond with technical Netflix Sans, balancing artistic vision and engineering precision. This refined vision speaks to top filmmakers and emerging talent, reflecting Eyeline's innovative trajectory sans industry clichés.",
    "fullContent": "Eyeline, a powerhouse bridging the worlds of VFX, studios, and experimental labs, faced a nuanced branding challenge: to craft a singular, compelling identity capable of uniting its diverse yet interconnected divisions. The goal was to transcend the often-clichéd visual language prevalent in the VFX sector, instead forging a sophisticated system that celebrated their global scale and innovative spirit while retaining an artisanal sense of craft. Los York’s solution began with a deceptively simple, yet profoundly insightful idea: the pixel as origin. This fundamental building block, the smallest unit of vision, became the perfect metaphor for Eyeline's work—where technology ignites creativity, and a single point of light can expand into entire worlds, laying the groundwork for an infinitely scalable and expressive visual language.\n\nFrom this potent starting point, a sophisticated, modular design system unfolded. The pixel concept evolved into a dynamic, grid-based framework, meticulously engineered to expand from micro-detail to macro-expression. This inherent adaptability mirrors Eyeline's own collaborative processes, seamlessly navigating film sets, digital workflows, and R&D environments. The grid allows for layouts that shift, stretch, and reconfigure depending on context, while always maintaining a clear, underlying order – a harmonious balance of precision and fluidity. Complementing this structural integrity, Los York ingeniously assigned each of Eyeline’s divisions a distinct color from the RGB spectrum: red for Studios, green for VFX, and blue for Labs. This not only provides immediate distinction but also serves as a subtle nod to the elemental forces of image-making, binding the diverse facets of Eyeline into a coherent whole.\n\nThe typographic choices further articulate Eyeline's dual nature. ITC Garamond Light Narrow imbues the identity with cinematic warmth, humanity, and a sense of legacy, grounding it in the rich history of filmmaking. This is expertly paired with Netflix Sans, a choice that not only acknowledges Eyeline’s key relationship with the streaming giant but also injects a forward-facing, digital precision. This deliberate tension between serif and sans perfectly encapsulates the brand's core ethos: where imagination meets engineering. By consciously sidestepping typical VFX visual clichés, Los York crafted an identity that acts as a clean, confident frame around Eyeline's extraordinary work, allowing their craft to take center stage. The result is a cinematic yet minimal, expressive yet restrained aesthetic. This thoughtful approach has garnered significant acclaim from both Eyeline's leadership and its peers, cementing a powerful identity that truly embodies the fusion of imagination and engineering, setting a new benchmark for industry branding."
  }
]