{
  "name": "Jacob Darling",
  "title": "Marketing Strategist & Systems Architect",
  "intro": "I build marketing systems that think for themselves. Turning complexity into clarity, chaos into competitive advantage.",
  "tagline": "I build marketing systems that think for themselves.",
  "summary": "A dynamic and results-driven Marketing Director and Systems Architect with over 15 years of experience propelling brand growth by bridging the gap between creative strategy and full-stack technical execution. Proven expertise in designing and personally engineering scalable marketing ecosystems for global brands serving 30,000+ practitioners. Adept at leveraging data-driven insights and AI-powered automation to elevate brand visibility, optimize campaigns, and consistently deliver exceptional ROI.",
  "chips": ["Solo operator", "16+ years", "Systems architect"],
  "contact": {
    "email": "jacob@jacobdarling.com",
    "location": "Indianapolis, IN",
    "website": "jacobdarling.com",
    "github": "https://github.com/JdarlingGT",
    "linkedin": "linkedin.com/in/jacobdarling"
  },
  "links": {
    "email": "jacob@jacobdarling.com",
    "website": "https://jacobdarling.com",
    "github": "https://github.com/JdarlingGT",
    "linkedin": "https://linkedin.com/in/jacobdarling"
  },
  "executiveSummary": "Marketing strategist and systems architect with 15+ years of experience building revenue-driving marketing infrastructure for global healthcare brands. Proven track record of transforming complex marketing challenges into measurable business results through strategic thinking, technical execution, and data-driven decision making. I bridge the gap between creative marketing vision and technical implementation, delivering systems that scale while driving measurable ROI. My expertise spans marketing automation, CRM architecture, web development, and revenue operations - positioning me uniquely to lead growth initiatives from strategy through execution.",
  "experience": [
    {
      "company": "Graston Technique, LLC",
      "image": "/images/auto-generated/graston-technique/placeholder.svg",
      "role": "Marketing Director",
      "dates": "Aug 2023 - Present",
      "location": "Indianapolis, IN",
      "summary": "Leads both marketing strategy and technical execution for a high-volume educational platform serving thousands of clinicians with continuing education and clinical tools.",
      "achievements": [
        "System Architecture: Built an integrated ecosystem with LearnDash LMS, WooCommerce, WP Fusion, Gravity Forms, Uncanny Automator, and FluentCRM. Architected 'Buy Now, Choose Later' credit system for training bundles and CEU Short access. Launched tiered provider directory with analytics dashboards and premium profile upsell paths.",
        "AI & Automation: Built and deployed a GPT-powered assistant connected to the site via REST APIs to assist with CEU rules, order lookups, training suggestions, and user escalation. Used Uncanny Automator and WP Fusion to build 400+ automations triggered by tags, training progress, or form submissions.",
        "Analytics & Dashboards: Created provider analytics dashboards syncing GA4 data via GTM and Analytify. Displays page views, link clicks, social metrics, UTM sources, and benchmark comparisons with admin override and export options.",
        "Performance & DevOps: Optimized site speed with WP Rocket, LiteSpeed, Cloudflare CDN, async/defer scripts, GTM server-side tagging. Built REST-based frontend dashboards with Cloudflare Workers + Mapbox for training event coordination.",
        "Cloudflare Optimizations: Rate-limiting, WAF rules, Bot Fight Mode, Caching & Tiered Cache, Managed Transforms, Page Rules, SSL/TLS Origin Cert, DNSSEC Setup (including GoDaddy DS Submission).",
        "Server & WordPress Enhancements: Compression (Brotli + gzip), Browser Caching, Security Headers, Cookie-Free CDN, LiteSpeed CDN Mapping & Optimizations, WP Rocket Page Cache, Liquid Web PHP Limits, PHP-FPM Optimization, PHP 8.3 Upgrade (Staging), WP Dashboard Clean-up, Cron & Heartbeat Tuning, ESI / Role-Vary Cache.",
        "Monitoring & Recovery: Netdata Monitoring & Alerts, Critical Error Recovery, Server Resource Review, Liquid Web PHP Handler Update.",
        "Code & Database Maintenance: Search & Replace Cleanup, Autoloaded Options Cleanup, JS Optimization (WP Rocket), Asset Optimization, Font & DNS Preload Fixes, Preload Cache Fix, Apache Tuning, Cloudflare Beacon & SRI Fix, Umami Analytics Endpoint Correction, Divi Module Refactor, Translation Handling (WP 6.7 Ready).",
        "Team Leadership: Manages cross-functional sprints with developers, designers, instructors, and marketing associates. Translates business goals into dev-ready specifications and user-friendly UX flows.",
        "Tracking & Conversion: Implemented Form Submission Tracking (Gravity Forms / GTM / Google Ads), GTM Engagement Tracking, GTM Preview Auth Setup, GTM v28 Cleanup & GA4 Only, Google Ads Conversion Optimization, Lead Conversion Event, OptinMonster Conversion Integration, Google Ads Conversion Configuration, PixelYourSite Pro: Tracking & Ads Sync.",
        "Instructor Tools & Integrations: Dynamic 'e3vent' Map Integration, Google Maps API Key Lockdown, Instructor Dashboard: Event Filtering, Instructor Dashboard: Instrument Visibility.",
        "Platform Development: LearnDash Multisite Planning."
      ],
      "technologies": [
        "LearnDash",
        "WooCommerce",
        "WP Fusion",
        "Gravity Forms",
        "Uncanny Automator",
        "FluentCRM",
        "WordPress",
        "JavaScript",
        "Google Analytics 4",
        "Google Tag Manager",
        "Analytify",
        "Cloudflare Workers",
        "Mapbox",
        "WP Rocket",
        "LiteSpeed",
        "Cloudflare CDN",
        "REST APIs",
        "OpenAI",
        "Netdata",
        "PHP 8.3",
        "GTM Server-Side Tagging"
      ]
    },
    {
      "company": "Ultimate Technologies Group",
      "role": "Interim Director of Marketing",
      "dates": "Mar 2023 - Jul 2023",
      "location": "Fishers, IN",
      "summary": "Spearheaded marketing strategy and execution during a key transitional period, ensuring business continuity and brand consistency across all channels.",
      "achievements": [
        "Managed end-to-end marketing communications, including internal messaging, external campaigns, and stakeholder engagement",
        "Led the development and optimization of Google Ads campaigns, improving lead generation, CTR, and overall ROI",
        "Oversaw content creation for website, email marketing, social media, and sales collateral to support business development initiatives",
        "Coordinated with cross-functional teams (sales, customer success, executive leadership) to align marketing strategy with organizational goals",
        "Implemented marketing automation workflows and CRM integrations to streamline operations and enhance campaign performance tracking",
        "Conducted market research and competitive analysis to refine targeting and positioning strategies",
        "Managed and optimized paid media and SEO efforts, driving qualified traffic and enhancing online visibility",
        "Directed branding updates and ensured visual and messaging alignment across all customer touchpoints",
        "Provided leadership and mentoring to the marketing team, ensuring high performance during organizational change"
      ],
      "technologies": [
        "Marketing Strategy",
        "Google Ads",
        "Marketing Automation",
        "CRM Integration",
        "SEO",
        "Paid Media",
        "Brand Management",
        "Campaign Management"
      ]
    },
    {
      "company": "Riley Bennett Egloff, LLP",
      "image": "/images/auto-generated/riley-bennett-egloff/placeholder.svg",
      "role": "Marketing Manager",
      "dates": "Jul 2022 - Mar 2023",
      "location": "Indianapolis, IN",
      "summary": "Led strategic marketing, digital communications, and client development for legal and professional services.",
      "achievements": [
        "Designed, built, and managed comprehensive marketing materials, including brochures, advertisements, email campaigns, newsletters, social media content, and RBE magazines",
        "Oversaw firm branding and content strategy across digital platforms, including full ownership of the RBE website—enhancing performance, SEO, and user experience",
        "Led public and media relations efforts: cultivated media relationships, drafted press releases, and secured firm publicity in legal news, thought leadership, and client matters",
        "Created and executed direct email marketing and social media campaigns; tracked performance metrics and optimized results",
        "Partnered with attorneys to develop and manage individualized business development plans—successfully identifying new opportunities for client engagement and growth",
        "Developed strategic pitch materials and managed RFP/proposal responses, showcasing firm capabilities with precision and impact",
        "Played a key role in industry submissions and award nominations, increasing firm visibility and market recognition",
        "Provided market intelligence insights to guide future strategy and business development planning",
        "Actively participated in practice group meetings, contributing actionable insights that drove firm-wide initiatives forward",
        "Established trusted relationships with practice group leaders and attorneys to support cross-selling and firm-wide business growth"
      ],
      "technologies": [
        "Strategic Marketing",
        "Digital Marketing",
        "SEO",
        "Content Strategy",
        "Email Marketing",
        "Social Media",
        "Public Relations",
        "Business Development",
        "RFP Management",
        "Project Management",
        "Brand Management"
      ]
    },
    {
      "company": "Riley Bennett Egloff, LLP",
      "image": "/images/auto-generated/riley-bennett-egloff/placeholder.svg",
      "role": "Marketing Administrator",
      "dates": "Jun 2015 - Nov 2022",
      "location": "Greater Indianapolis",
      "summary": "Responsible for managing content marketing initiatives, website content, social media platforms, graphic design and ad creation, overall firm-to-client communication, and brand development.",
      "achievements": [
        "Assisted in responding to the firm's RFP responses",
        "Worked in conjunction with the Marketing Committee to carry out the firm's strategic marketing plan",
        "Managed and developed business development plans for attorneys"
      ],
      "technologies": [
        "Content Marketing",
        "Brand Development",
        "Business Development",
        "Social Media",
        "Graphic Design",
        "RFP Management"
      ]
    },
    {
      "company": "Deerfield Financial Advisors",
      "role": "Marketing Coordinator",
      "dates": "Jun 2013 - Jun 2015",
      "location": "Indianapolis, IN",
      "summary": "Executed marketing initiatives and campaigns to elevate brand awareness and attract new clients while supporting ongoing engagement with existing clients and professional partners.",
      "achievements": [
        "Planned and managed successful client-facing seminars and events, enhancing client retention and brand credibility",
        "Wrote and maintained content for the company website, email marketing campaigns, and printed collateral, ensuring consistency and clarity in brand messaging",
        "Researched, evaluated, and implemented new technology platforms, improving both client services and internal operational efficiency",
        "Collaborated with the Chief Compliance Officer to review all marketing materials, ensuring full compliance with FINRA and SEC regulations"
      ],
      "technologies": [
        "Content Development",
        "Email Marketing",
        "Event Management",
        "Website Management",
        "Technology Implementation",
        "FINRA Compliance",
        "SEC Compliance"
      ]
    },
    {
      "company": "Pike Medical Consultants",
      "image": "/images/auto-generated/pike-medical/placeholder.svg",
      "role": "Marketing Coordinator",
      "dates": "Sep 2009 - Jun 2013",
      "location": "Greater Indianapolis",
      "summary": "Directed all marketing functions for the organization, including strategic planning, budgeting, advertising, branding, public relations, website development, and event management, while reporting directly to the company president.",
      "achievements": [
        "Drove a 45% increase in patient visits over three years, maintaining a consistently positive ROI across all marketing initiatives",
        "Designed and executed integrated marketing and advertising campaigns that directly contributed to sustained company growth",
        "Led the creation of a new company website, modernizing the digital presence and improving patient engagement and lead generation",
        "Developed and managed internal and external communication strategies to strengthen brand positioning and market visibility",
        "Oversaw public relations efforts to increase awareness and credibility in the healthcare community",
        "Implemented data-driven tracking and evaluation processes to measure the effectiveness of campaigns and inform future strategy"
      ],
      "technologies": [
        "Strategic Planning",
        "Budgeting",
        "Website Development",
        "Google Ads",
        "Public Relations",
        "Brand Management",
        "Campaign Management",
        "Data Analytics",
        "Event Management"
      ]
    },
    {
      "company": "OrthoIndy",
      "role": "Marketing Intern",
      "dates": "2006 – 2007",
      "location": "Indianapolis, IN",
      "summary": "Gained foundational experience in a professional healthcare marketing environment, assisting with content and event coordination.",
      "achievements": [
        "Assisted with content development and event coordination in a professional healthcare marketing environment"
      ],
      "technologies": ["Content Coordination", "Event Management"]
    }
  ],
  "skills": [
    "Strategic Marketing & Leadership",
    "Brand Strategy & Transformation",
    "Lifecycle & Email Marketing",
    "Content Strategy & Technical SEO",
    "Data Analytics & Attribution Modeling",
    "Agile Project Management",
    "Team Leadership & Cross-Functional Collaboration",
    "Annual Budget Management ($500K+)",
    "Full-Stack Web Development (WordPress, JavaScript, React)",
    "CRM Architecture & Automation (HubSpot, FluentCRM, WP Fusion)",
    "AI & GPT-Powered Tool Integration (OpenAI, REST APIs)",
    "Performance & Security Optimization (Cloudflare, LiteSpeed, WP Rocket)",
    "Custom Analytics Dashboards (GA4, GTM, Mapbox)",
    "LMS & E-Commerce Integration (LearnDash, WooCommerce)",
    "Serverless Development (Cloudflare Workers)"
  ],
  "tools": [
    "WordPress",
    "JavaScript",
    "React",
    "HubSpot",
    "FluentCRM",
    "WP Fusion",
    "LearnDash",
    "WooCommerce",
    "Google Analytics",
    "Google Tag Manager",
    "Mapbox",
    "Cloudflare Workers",
    "Cloudflare CDN",
    "WP Rocket",
    "LiteSpeed",
    "ACF Pro",
    "FacetWP",
    "Figma",
    "Adobe Creative Suite",
    "Canva",
    "Photoshop"
  ],
  "education": [
    {
      "institution": "Indiana University-Bloomington",
      "degree": "Bachelor's degree in Business Management",
      "year": "August 2004 – May 2008",
      "details": "Won 2006 Target Marketing Competition"
    }
  ],
  "communityLeadership": [
    {
      "organization": "School 80 Condominiums HOA",
      "role": "President",
      "dates": "2019 – Present",
      "summary": "Lead board operations and community management."
    },
    {
      "organization": "Primary Colours",
      "role": "Board Member",
      "dates": "2018 – 2019",
      "summary": "Supported a non-profit for visual arts, leading marketing for events."
    },
    {
      "organization": "SMART Anti-Bullying Program",
      "role": "Business Mentor",
      "dates": "2013",
      "summary": "Guided students in creating a business and marketing plan."
    }
  ],
  "volunteerExperience": [
    {
      "organization": "School 80 Condominiums Home Owners Association",
      "role": "President",
      "dates": "Oct 2019 - Present",
      "summary": "Volunteer as President for the School 80 Condominiums Home Owners Association."
    },
    {
      "organization": "Primary Colours",
      "role": "Board Member",
      "dates": "Jan 2018 - Dec 2019",
      "summary": "Primary Colours is a non-profit organization dedicated to serving visual art and culture and connecting artists with their communities. Facilitated interaction between visual artists and the community, and created and sustained a thriving environment for the visual arts through unique exhibitions, cultural events, and resources for up-and-coming artists."
    },
    {
      "organization": "SMART - Anti Bullying at School #96",
      "role": "Business Mentor",
      "dates": "Jan 2013 - May 2013",
      "summary": "Volunteered to help a group of students build a business and marketing plan for their anti-bullying program."
    },
    {
      "organization": "Primary Colours",
      "role": "Marketing",
      "dates": "Feb 2017 - Present",
      "summary": "Designed website and print materials for Primary Colours annual event, Installation Nation."
    },
    {
      "organization": "School 80 Condominiums Home Owners Association",
      "role": "Board Member",
      "dates": "Dec 2015 - Present",
      "summary": "Volunteer as a board member for the School 80 Condominiums Home Owners Association."
    },
    {
      "organization": "Frances W Parker IPS School 56",
      "role": "Marketing Volunteer",
      "dates": "Jun 2017 - Jul 2017",
      "summary": "Designed posters (12) for the school's Situational VALUES project."
    },
    {
      "organization": "Walk to Defeat ALS - Indianapolis",
      "role": "Event Volunteer",
      "dates": "Jan 2016 - Jan 2017",
      "summary": "Volunteered for the Walk to Defeat ALS event in Indianapolis."
    },
    {
      "organization": "Eastwood Middle School Soccer Team",
      "role": "Designer",
      "dates": "Jan 2017 - Present",
      "summary": "Designed and printed shirts for Eastwood Middle School women's soccer team."
    }
  ],
  "stats": {
    "experience": "15+",
    "practitioners": "30K+",
    "caseStudies": "14+",
    "customApps": "4+"
  },
  "metrics": [
    {
      "value": "30K+",
      "label": "Users Served",
      "icon": "users"
    },
    {
      "value": "+40%",
      "label": "Conversions",
      "icon": "trending"
    },
    {
      "value": "400+",
      "label": "Automations",
      "icon": "zap"
    },
    {
      "value": "-70%",
      "label": "Support Tickets",
      "icon": "shield"
    }
  ],
  "testimonials": [
    {
      "id": "jesse-wey",
      "name": "Jesse Wey",
      "role": "Web Development | IT | Marketing",
      "company": "",
      "quote": "I've known Jacob and worked with him off and on for more than two decades, and he continues to impress me with the energy, creativity, and passion he brings to everything he does. He thrives in fast-paced environments and is always eager to explore new tools and technologies to get results. Jacob has a great balance of strategic thinking and hands-on execution.",
      "avatar": "",
      "featured": true
    },
    {
      "id": "kevin-martin-see",
      "name": "Kevin Martin See",
      "role": "IBMer | Connector | Ally",
      "company": "IBM",
      "quote": "Jacob displays a combination of creative and analytical skills, with proven ability to assess and implement marketing strategies that produce a positive return on investment.",
      "avatar": "",
      "featured": true
    },
    {
      "id": "terrence-black",
      "name": "Terrence L. Black",
      "role": "Co Owner",
      "company": "ResQ Organics",
      "quote": "What stands out the most in working with him is his energy and enthusiasm for what he does. I highly recommend Jacob.",
      "avatar": "",
      "featured": true
    }
  ],
  "certifications": [],
  "awards": [
    {
      "title": "Gold Key Photography Award",
      "organization": "Scholastic Art & Writing Awards",
      "year": "2008",
      "description": "Top-tier recognition in visual arts"
    }
  ],
  "showreel": [
    {
      "id": "graston-dashboard",
      "title": "Graston Dashboard",
      "type": "image",
      "src": "/images/case-studies/graston-dashboard/cover.svg",
      "description": "Healthcare data dashboard redesign"
    },
    {
      "id": "cinematic-portfolio",
      "title": "Cinematic Portfolio",
      "type": "image",
      "src": "/images/case-studies/cinematic-portfolio/cover.svg",
      "description": "Motion-driven storytelling experience"
    },
    {
      "id": "branding-reel",
      "title": "Branding Reel",
      "type": "image",
      "src": "/images/case-studies/branding-reel/cover.svg",
      "description": "Visual brand identity showcase"
    },
    {
      "id": "317-bbq",
      "title": "317 BBQ Growth Engine",
      "type": "image",
      "src": "/images/side-projects/317-bbq.svg",
      "description": "E-commerce and lifecycle automation"
    }
  ]
}
