{
  "testimonials": [
    {
      "id": "jesse-wey",
      "name": "Jesse Wey",
      "role": "Web Development | IT | Marketing",
      "relationship": "Worked together for over two decades",
      "date": "October 2025",
      "quote": "I've known Jacob and worked with him off and on for more than two decades, and he continues to impress me with the energy, creativity, and passion he brings to everything he does. He thrives in fast-paced environments and is always eager to explore new tools and technologies to get results. Jacob has a great balance of strategic thinking and hands-on execution, and I've learned a lot from working alongside him. I'd recommend him to anyone looking for a marketing professional who's both forward-thinking and results-oriented.",
      "highlight": "Great balance of strategic thinking and hands-on execution"
    },
    {
      "id": "andrew-bastnagel",
      "name": "Andrew Bastnagel, MBA",
      "role": "Financial Services Consultant | Digital Transformation Strategist",
      "relationship": "Worked together across companies",
      "date": "October 2025",
      "quote": "Jacob is the kind of marketer who makes an immediate impact. His passion and energy for the field show up in everything he does, from brainstorming creative campaigns/projects to diving into data to understand what really drives results. He's constantly learning new technologies and figuring out how to put them to work in practical ways, whether it's adopting new tools to improve targeting or using analytics platforms to refine messaging. That curiosity and drive to improve make him not just effective, but always evolving as a marketer. On top of that, Jacob has a sharp eye for benchmarking and understanding where the market is headed. He's skilled at matching strategies to trends and ensuring that his work doesn't just keep pace but often leads the way. Beyond his marketing talent, he's a loyal and dependable teammate and someone you know you can count on to follow through, support the team, and stay committed to the bigger picture. Any team would be lucky to have someone with his mix of creativity, adaptability, and reliability.",
      "highlight": "Makes an immediate impact with creativity, adaptability, and reliability"
    },
    {
      "id": "jerry-stern",
      "name": "Jerry Stern",
      "role": "Internet Entrepreneur | Professional Change Agent",
      "relationship": "Professional acquaintance",
      "date": "Various",
      "quote": "I knew and had dealings with Jacob several years ago. At the time I thought he was a stand up guy. He was very competent and professional and I always knew that if he'd said something, you could count on.",
      "highlight": "Very competent and professional - you can count on him"
    },
    {
      "id": "kevin-martin-see",
      "name": "Kevin Martin See",
      "role": "IBMer | Connector | Ally",
      "relationship": "Studied together",
      "date": "October 2014",
      "quote": "Jacob is an involved and dedicated marketer. His exuberance, and moxie are unparalleled. He excels in managing multiple projects concurrently with strong detail, problem solving, and follow-though. Jacob displays a combination of creative and analytical skills, with proven ability to assess and implement marketing strategies that produce a positive return on investment.",
      "highlight": "Excells in managing multiple projects with strong detail and problem-solving"
    },
    {
      "id": "nick-brown",
      "name": "Nick Brown",
      "role": "DMA, Inc.",
      "relationship": "Worked together on projects",
      "date": "October 2013",
      "quote": "Jacob Darling has done PR and marketing for DMA Inc. in the past. He is hardworking, creative and a pleasure to work with. Jacob has skills in web design, branding, and personal communication. I would work with Jacob again and recommend others to do the same.",
      "highlight": "Hardworking, creative, and a pleasure to work with"
    },
    {
      "id": "terrence-black",
      "name": "Terrence L. Black",
      "role": "Co Owner ResQ Organics",
      "relationship": "Worked together on different teams",
      "date": "April 2013",
      "quote": "I found Jacob to have great communication skills and creative abilities. He is focused and engaged in the projects he directs and participates in. What stands out the most in working with him is his energy and enthusiasm for what he does. I highly recommend Jacob.",
      "highlight": "Great communication skills and creative abilities with exceptional energy"
    },
    {
      "id": "kara-lynch",
      "name": "Kara Lynch",
      "role": "Cranial Neurosurgery Referral Specialist",
      "relationship": "Worked together at Pike Medical",
      "date": "March 2013",
      "quote": "Jacob has a wonderful eye for marketing! He was consistently finding new ways to get Pike Medical Consultants exposure as well as planning and running events to involve the community. His lighthearted attitude made him approachable to his coworkers.",
      "highlight": "Wonderful eye for marketing with approachable, lighthearted attitude"
    },
    {
      "id": "clayton-mathews",
      "name": "Clayton Mathews",
      "role": "Violinist",
      "relationship": "Worked together at Pike Medical",
      "date": "February 2013",
      "quote": "Jacob is extremely good at working with people and efficient at getting projects organized and completed. Also important to any job environment is that he is loyal to those he surrounds himself with. I have known and worked with Jacob for a long time and full-heartedly recommend him for the position of Marketing Director at Pike Medical Consultants.",
      "highlight": "Extremely good at working with people and efficient project organizer"
    },
    {
      "id": "jared-duymovic",
      "name": "Jared Duymovic",
      "role": "Arts Community Builder",
      "relationship": "Corporate sponsor relationship",
      "date": "February 2013",
      "quote": "Jacob has always been forthcoming and exceedingly willing to get the job done. I have appreciated his relaxed nature in spite of hectic schedules and his reassuring demeanor when that is needed. Jacob has represented his company (a corporate sponsor of mine) admirably.",
      "highlight": "Forthcoming and exceedingly willing to get the job done"
    },
    {
      "id": "ben-worrell",
      "name": "Ben Worrell",
      "role": "Senior Administrative Assistant, Pike Medical Consultants",
      "relationship": "Worked together at Pike Medical",
      "date": "October 2009",
      "quote": "Jacob's energy and ingenuity are both extremely valuable assets that we have added to Pike Medical Consultants. He has expanded our vision and implemented many new projects and outreach opportunities through networking and advertising. I look forward to the future of Pike Medical with Jacob on board with us.",
      "highlight": "Energy and ingenuity are extremely valuable assets"
    }
  ]
}

